#   B - матрица, i - кол-во строк, j - столбцов, f - длина B
#   x - индекс прошлой единицы, z - текущей, o - кол-во нулей в области


B = [[0,0,0,0,0,0,0,0],
     [0,0,0,0,0,0,0,0],
     [0,0,0,1,1,0,0,0],
     [0,0,1,1,1,1,0,0],
     [0,0,1,0,0,1,1,1],
     [0,1,1,0,0,0,1,1],
     [0,1,1,0,0,0,1,1],
     [1,1,1,1,1,1,1,1]]

#   Вывод матрицы   

for q in B:
    print(q)
print()

f = len(B)       
o = 0

#   Вычисление кол-ва нулей при помощи индексов

for i in range(f):
    z = 0
    for j in range(f):
        if B[i][j] == 1:
            x = z
            z = j
            if x != 0:
                o += z - x - 1
        
            
print('Количество нулей в области:',o)






            

